[
  {
    "category": "Веб-разработка",
    "name": "Ajax, REST API OpenCart",
    "slug": "ajax-rest-api-opencart",
    "description": "В статье рассмотрим как устроены ajax запросы в OpenCart, в том числе запросы через api OpenCart, познакомимся с новым понятием front controller и немного коснемся темы ajax REST API.",
    "posts_text": "В статье рассмотрим как устроены ajax запросы в OpenCart, в том числе запросы через api OpenCart, познакомимся с новым понятием front controller и немного коснемся темы ajax REST API.\n\nКлиент\nКлиентская часть OpenCart работает с использованием jquery, а значит можно использовать $.ajax из этой библиотеки. Ссылка на документацию. Примеры ajax запросов на клиентской части можно посмотреть в admin/view/template/sale/order_form.tpl (.twig для OpenCart 3.0).\n\nСервер\nПросматривая все тот же файл admin/view/template/sale/order_form.tpl (для OpenCart 2.3) можно понять, что в качестве адреса вызова используется классическая схема роутинга OpenCart. Посмотрим на один из запросов:\n\n$.ajax({\n    url: 'index.php?route=customer/customer/autocomplete&token=<?php echo $token; ?>&filter_name=' +  encodeURIComponent(request),\n    ...\nВсе просто: url - путь до контроллера и, если надо, имя метода этого контроллера.\n\nТо есть, нам нужно создать класс контроллера, затем из файлов представления можно вызывать методы этого контроллера ajax запросами.\n\nСоздадим контроллер нашего нового тестового модуля по пути admin/controller/extension/module/myajax.php:\n\nclass ControllerExtensionModuleMyAjax extends Controller\n{\n    public function index()\n    {\n        $this->response->addHeader('Content-Type: application/json');\n        $this->response->setOutput(json_encode(\n            [\n                \"success\" => true, \n                \"message\" => \"ok\", \n                \"data\" => []\n            ]\n        ));\n    }\n}\nВ классе контроллера есть объект response, это экземпляр класса Response , который расположен по пути system/library/response.php. Он позволяет управлять ответом сервера. Нас интересуют только 2 метода:\n\naddHeader($header) - добавить http заголовок, header строковый аргумент\n\nsetOutput($output) - установить данные для вывода, output строковый аргумент\n\nДля формирования ответа на запрос в методе контроллера можно использовать -\n\n$this->response\n\nТак как OpenCart имеет 2 режима доступа/контекста (admin, catalog), то передаваемые данные в запросах разные:\n\nadmin - требует токен в get параметре (получить можно из объекта класса контроллера):\n\nдля OpenCart 2.3 token, который берется из $this->session->data['token']\n\nдля OpenCart 3.0 ¨C4C, который берется из¨C14C¨C5C\n\ncatalog - в общем случае не требует токена, но есть нюансы о которых позже\n\nТеперь чтобы осуществить ajax запрос достаточно в файл представления (читай в html) подставить js (код для OpenCart 2.3):\n\n$.ajax({\n    url: '<?php echo $admin; ?>index.php?route=extesion/module/myajax&token=<?php echo $token; ?>',\n    type: 'get',\n    dataType: 'json',\n    success: function(json) {\n        alert(\"success: \"+json[\"success\"]+\"\\n\"+\"message: \"+json[\"message\"]);\n    },\n    error: function(xhr, ajaxOptions, thrownError) {\n        alert(thrownError + \"\\r\\n\" + xhr.statusText + \"\\r\\n\" + xhr.responseText);\n    }\n});\nВ этом коде в url admin это путь указывающий контекст запроса (admin или catalog). Для контекста есть 2 дефайна, определенных в admin/config:\n\nHTTP_SERVER или HTTP<b style=\"box-sizing: border-box;\">S</b>_SERVER - путь до директории admin (проще - админка), где будет осуществлен поиск контроллера для выполнения запроса\n\nHTTP_CATALOG или ¨C6C¨C15C- корень сайта, однако контроллеры будут браться из директории¨C16C¨C7C\n\nAjax API\nПросматривая файл представления admin/view/template/sale/order_form.tpl (OpenCart 2.3), можно увидеть что из админки осуществляются ajax запросы на catalog контекст, с использованием особого токена.\n\nСначала объявляется глобальная переменная token, затем ajax запрос на адрес /index.php?route=api/login, который отвечает json данными, в которых есть ключ token:\n\nvar token = '';\n \n// Login to the API\n$.ajax({\n    url: '<?php echo $catalog; ?>index.php?route=api/login',\n    type: 'post',\n    data: 'key=<?php echo $api_key; ?>',\n    dataType: 'json',\n    crossDomain: true,\n    success: function(json) {\n    //...\n \n        if (json['token']) {\n            token = json['token'];\n        }\n    },\n    error: function(xhr, ajaxOptions, thrownError) {\n        alert(thrownError + \"\\r\\n\" + xhr.statusText + \"\\r\\n\" + xhr.responseText);\n    }\n});\nКонтроллер этого запроса находится в catalog/controller/api/login.php ControllerApiLogin::index. Он:\n\nсоздает новую сессию\n\n(catalog/model/account/api.php - ModelAccountApi::addApiSession) и\n\nгенерирует для нее случайный токен (функция token находится в system/helper/general.php),\n\nкоторый возвращается в json этого ajax запроса, если доступ по api (api_key) разрешен для текущего пользователя (Админка-Система-API).\n\nДальше разбирая представление admin/view/template/sale/order_form.tpl можно увидеть, что последующие ajax запросы, которые по адресу route=api/... используют этот самый tokenдля определения права доступа, таким образом (в каждом api файле, в каждом методе)¨C25C существует такой кусок кода для определения права осуществлять запрос:\n\nif (!isset($this->session->data['api_id'])) {\n    $json['error']['warning'] = $this->language->get('error_permission');\n} else {\n    ...\n}\nAjax запросы через catalog контекст можно осуществлять с использованием token для безопасного доступа\n\nА теперь копнем глубже и выясним, как это происходит внутри движка, ведь можно отправлять ajax запросы и без токена.\n\nПросматривая код файла index.php отправляемся в system/startup.php, оттуда следуем в system/framework.php в самый конец и видим такое вот:\n\n// Front Controller\n$controller = new Front($registry);\n \n// Pre Actions\nif ($config->has('action_pre_action')) {\n    foreach ($config->get('action_pre_action') as $value) {\n        $controller->addPreAction(new Action($value));\n    }\n}\nЗдесь видим новое понятие front controller, код которого находится в system/engine/front.phpв классе Front.\n\nНиже следует мое субъективное определение этого понятия :)\n\nПодробных комментариев найти не удалось, но судя по коду front controller это главный/передний контроллер, он запускает общий контроллер startup/router относительно директории controller контекста (admin/controller или catalog/controller), который выполняет первичные контроллеры, указанные в $_['action_pre_action']; в файле system/config/catalog.php.\n\nВ коде выше происходит только добавление первичных контроллеров во front controller, а их исполнение осуществляется кодом ниже, в методе dispatch (внутри метода перед выполнением action указанного в $config->get('action_router')):\n\n// Dispatch\n$controller->dispatch(new Action($config->get('action_router')), new Action($config->get('action_error')));\nСреди первичных контроллеров есть startup/session относительно catalog/controller, где в ControllerStartupSession::index находится интересующий нас код для авторизации в api через токен. Вкратце:\n\nпроисходит проверка обращения к api/ и наличия get параметра token\n\nудаление старых api сессий\n\nвыборка актуальной api сессии на основании ip адреса запросившего и его токена\n\nстарт сессии с id из $_COOKIE[\"api\"]\n\nобновление времени модификации сессии, (чтобы она осталась жива, то есть не была устаревшей)\n\nТеперь, когда исполнение кода дойдет до целевого контроллера, $this->session->data['api_id'] уже будет инициализировано, если указана актуальная комбинация токена и ip адреса.\n\nAjax REST API\nДанная глава описывает возможный вариант создания и встроенные средства реализации REST API в OpenCart.\n\nМы рассмотрели реализацию ajax запросов OpenCart для admin и catalog контекстов.\n\nЕсли говорить об admin, то предполагается более рациональным реализовывать контроллеры именно в admin контексте. Однако, такое не всегда возможно. Иногда один и тот же код контроллера (возможно речь о методе контроллера) должен использоваться в обработчике catalog события (например при изменении заказа), так и отдельно непосредственно при работе с заказом через админку. Чтобы устранить такие случаи можно реализовать контроллеры в catalog контексте и организовать для них безопасный доступ (о чем говорится в предыдущей главе).\n\nДля реализации REST API в OpenCart есть все необходимое:\n\nобъект для работы с ответом сервера в контроллере $this->response, а именно методы addHeader и setOutput \n\nбезопасная работа с административным доступом через catalog¨C22Cконтекст\n\nединая точка входа api через¨C24C¨C10C¨C25C контекст, в директорию¨C26C¨C11C¨C27C, можно размещать свои файлы контроллеров и при помощи ajax осуществлять к ним запросы\n\nНа стороне сервера надо создать контроллеры в catalog/controller/api/, а на стороне клиента добавить ajax запросы в нужные файлы представлений с использованием токена, полученного в результате ajax запроса api/login. Если в этих файлах нет такого ajax запроса, тогда необходимо добавить его, например, взяв из admin/view/template/sale/order_form.tpl.Теперь чтобы сделать REST API достаточно изучить, что это такое, несколько ссылок:\n\nhttps://ru.wikipedia.org/wiki/REST\n\nhttps://habr.com/ru/post/483202/",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  },
  {
    "category": "Маркетинг",
    "name": "Топ-15 ошибок в email-маркетинге",
    "slug": "top-15-oshibok-v-email-marketinge",
    "description": "Чем грамотнее ведется email-маркетинг, тем больше прибыли он приносит. Мы подготовили подборку самых распространенных ошибок, которые допускаются при запуске рассылок. Рассказываем, к чему они приводят, как их избежать и не упустить прибыль.",
    "posts_text": "Чем грамотнее ведется email-маркетинг, тем больше прибыли он приносит. Мы подготовили подборку самых распространенных ошибок, которые допускаются при запуске рассылок. Рассказываем, к чему они приводят, как их избежать и не упустить прибыль.\n\nКампания будет успешной, если избежать ошибок на старте.\nКампания будет успешной, если избежать ошибок на старте.\n1. Работать с устаревшей базой\nМногие компании собирают контакты годами и, когда запускают рассылку, оказывается, что часть адресов некорректна и письма на них доставить невозможно. Например, email написали с ошибкой или клиент давно не пользуется электронным ящиком, и тот превратился в спам-ловушку. Если лимит возвратов (ошибок доставки) будет превышен, рассылку могут заблокировать.\n\nРешение\n\nНачинайте рассылку, как только получили первые контакты. Разработайте приветственную серию писем, которая автоматически будет уходить новым подписчикам.\n\nЕсли рассылку не отправляли более 3 месяцев, перед запуском очистите базу от невалидных адресов, например, с помощью встроенного в сервис DashaMail валидатора.\n\nСервис очищает базу от некорректных адресов и дублей, чтобы рассылку получали только «живые» подписчики\nСервис очищает базу от некорректных адресов и дублей, чтобы рассылку получали только «живые» подписчики\n2. Не использовать реанимационные письма\nЕсли с базой давно не работали, то пользователи могут не помнить, что подписывались на рассылку и будут жаловаться на СПАМ. От этого может пострадать ваша почтовая репутация.\n\nРешение\n\nОтправляйте реанимационные письма тем, кто давно не получал вашу рассылку.\n\nНапомните, когда и при каких обстоятельствах пользователь оставил вам электронный адрес.\n\nРасскажите о пользе, которую подписчик получит от рассылки: специальные предложения, полезные материалы, бонусы.\n\nВ реанимационном письме напомните где и как получатель подписался на рассылку, и чем будут полезны для него ваши рассылки\nВ реанимационном письме напомните где и как получатель подписался на рассылку, и чем будут полезны для него ваши рассылки\n3. Не настраивать домен\nЕсли не настроить домен, то им могут воспользоваться злоумышленники. В результате пострадает почтовая репутация: письма будут отправляться в спам, а домен будет внесен в блэклисты.\n\nРешение\n\nПропишите в DNS-настройках вашего домена записи SPF, DKIM и DMARC. Эти цифровые подписи призваны проверять подлинность отправителя и запускать утвержденный алгоритм действий при возникновении подозрений на мошенничество.\n\n4. Отправлять рассылку с адреса, зарегистрированного на общедоступном домене\nИспользовать в регулярных рассылках обратные адреса на общедоступной почте недопустимо. Пример – ххх@mail.ru. Последствия все те же: спам и блокировки.\n\nРешение\n\nВыход – обратный адрес на корпоративном домене. Например: news@fixprice.news.\n\nПример рассылки с обратным адресом на корпоративном домене\nПример рассылки с обратным адресом на корпоративном домене\nЗавести корпоративную почту достаточно просто, а главное, что это можно сделать совершенно бесплатно. Как именно? Рассказали в статье.\n\n5. Нарушать правила почтовых провайдеров\nЕсли не соблюдать правила почтовых провайдеров, рассылка может попасть в их спам-фильтр. Вот некоторые из самых распространенных нарушений: \n\nне добавить ссылку отписки;\n\nверстать письмо сплошной картинкой;\n\nиспользовать одинаковые обратные адреса для транзакционных и массовых рассылок;\n\nиспользовать сервисы для сокращения ссылок и др.\n\nРешение\n\nСледите за соблюдением правил можно самостоятельно или с помощью инструментов email-сервисов. Например, в сервисе DashaMail предусмотрена функция СтопСпам для проверки технических настроек отправителя и контента письма.\n\nСервис определяет вероятность прохождения спам-фильтра Яндекс, Gmail, Рамблер и Mail.ru\nСервис определяет вероятность прохождения спам-фильтра Яндекс, Gmail, Рамблер и Mail.ru\n6. Не проверять рассылку перед отправкой\nВ этом случае письма могут некорректно отображаться на разных устройствах, улетать в спам, и исправить это будет нельзя.\n\nРешение\n\nОтправляйте рассылку тестовым адресам разных провайдеров. Так вы убедитесь, что верстка адаптируется, письмо не попадает в спам, теги персонализации работают. Если у рассылки выявятся проблемы, вы сможете их устранить.\n\nКроме того, DashaMail предлагает встроенный инструмент для предпросмотра отображения рассылки в разных почтовых клиентах, который называется \"Провидица\". Он позволяет проверить отображение верстки в наиболее популярных почтовых программах:\n\nПровидица позволяет проверить отображение верстки в наиболее популярных почтовых программах ещё до отправки рассылки\nПровидица позволяет проверить отображение верстки в наиболее популярных почтовых программах ещё до отправки рассылки\n7. Отправлять много писем после долгого молчания\nЕсли вы давно не делали рассылку, при резком скачке активности почтовые провайдеры могут заподозрить вас в отправке спама.\n\nРешение\n\nЧтобы рассылка не вызывала подозрений, постепенно увеличивайте количество отправляемых писем: первый день – 500, второй – 800, третий – 1200, четвертый – 2000 и т. д.\n\n8. Отправлять письма нерегулярно\nБессистемная рассылка «убивает» базу: подписчики не знают, когда ждать ваши письма, забывают, кто вы, и отписываются или жалуются.\n\nРешение\n\nСоставьте план рассылок на несколько месяцев вперед, чтобы даже форс-мажор не нарушил распорядок. Когда пользователи знают, чего от вас ожидать, они открывают письма чаще и охотнее переходят по ссылкам.\n\n9. Пренебрегать прехедером\nПрехедер, как и заголовок, помогает привлечь внимание подписчика и побудить его открыть письмо. Код письма или сухой текст вместо актуальной информации сокращают шансы на открытие.\n\nРешение\n\nУделяйте прехедеру не меньше внимания, чем выбору заголовка или имени отправителя. Пусть он будет логичным дополнением темы, внесет интригу или, напротив, ясность – в зависимости от вашей ниши и задачи рассылки.\n\nНа фоне других удалось выделиться прехедерам от Дайджест Нетологии (интрига), Читай город (информативность) и Ozon (лаконичность)\nНа фоне других удалось выделиться прехедерам от Дайджест Нетологии (интрига), Читай город (информативность) и Ozon (лаконичность)\n10. Не предусмотреть форму обратной связи\nВ письмах, которые приходят с адреса «noreply», читается посыл – «Не пишите нам в ответ». Это допустимо для транзакционных писем, но нежелательно для массовой рассылки – негативно сказывается на лояльности, равно как и отсутствие формы обратной связи или шаблонные адресанты.\n\nРешение\n\nОткажитесь от обезличенных отправителей, например, Admin.\n\nНе используйте в адресе «noreply».\n\nПроверяйте, какой обратной связью делятся подписчики.\n\nВпечатление от трогательного письма, подписанного, к слову, главным редактором любимого портала, немного подпортил адресант – noreply@tourister.ru\nВпечатление от трогательного письма, подписанного, к слову, главным редактором любимого портала, немного подпортил адресант – noreply@tourister.ru\n11. Делать рассылку бесполезной для подписчика\nПисьма с навязчивым призывом к покупкам чаще отправляют в спам. Туда же попадают рассылки, которые не несут пользы конкретному получателю. Например, женщине, которая год назад покупала подгузники для шестимесячных детей, отправляют предложения с товарами для новорожденных.\n\nРешение\n\nРассылки должны быть заточены под интересы клиентов. Изучите свою целевую аудиторию, определите ожидания и страхи пользователей, чтобы снимать возражения в письмах.\n\nНа основе указанных при регистрации данных и поведенческих факторов составьте профиль подписчика. Сегментируйте клиентов по полу, возрасту, часовому поясу, хобби и др. – критерии зависят от сферы вашего бизнеса. Чем более персонализированным будет письмо, тем выше шансы на открытие, переход по ссылке и покупку. Подробнее о персонализации читайте в статье в нашем блоге.\n\n12. Вводить подписчика в заблуждение\nКлиенты отвернутся, если увидят, что их часто вводят в заблуждение. Например, вы указали, что акция завершится 14 января, а 15 снизили цену еще больше. Другая ситуация: пользователь соглашался получать полезный контент, а на деле через день видит рекламные письма.\n\nРешение\n\nЧтобы подписчики вам доверяли, выполняйте обещанное. Например, если указали в письме, что в следующем месяце появится новая коллекция, подготовьте рассылку заранее или включите эту тему в контент-план – на случай ухода в отпуск или увольнения маркетолога, аврала или форс-мажора.\n\n13. Подбирать заголовки, которые не соответствуют письму\nНе соответствующий содержанию письма заголовок – манипуляция, которая в краткосрочной перспективе даст высокий процент открытий, но в перспективе обернется разочарованием подписчика, утратой доверия к отправителю, ростом жалоб и отписок.\n\nРешение\n\nМотивируйте к открытию, но не обманывайте. Откажитесь от кликбейта в пользу правдивого отражения содержания письма и сохранения репутации.\n\n14. Вставлять слишком много призывов к действию\nКогда в одном письме встречаются просьбы перейти на сайт, оформить заказ и поделиться акцией в социальных сетях, цель рассылки теряется и пользователь не понимает, на что обратить внимание. \n\nРешение\n\nПридерживайтесь правила: одно письмо – один призыв к действию – одна ссылка.\n\nКогда в письме несколько призывов к действию, сложнее отследить эффективность рассылки. В примере от Monopoly всего одна ссылка, так что задача предельно понятна – перейти на сайт партнера, чтобы получить приз.\nКогда в письме несколько призывов к действию, сложнее отследить эффективность рассылки. В примере от Monopoly всего одна ссылка, так что задача предельно понятна – перейти на сайт партнера, чтобы получить приз.\n15. Не проверять гипотезы\nКакой цвет кнопки удачнее или когда именно отправлять рассылку – решение, продиктованное интуицией, может быть ошибочным. Это чревато сниженными показателями и потерей прибыли.\n\nРешение\n\nЧтобы внедрять только удачные варианты, используйте сплит-тесты. С их помощью определяйте лучшую гипотезу на основании статистики. Результатам тестирования можно доверять: учитывается даже математическая погрешность.\n\nСервис DashaMail поможет вам избежать большинства распространенных ошибок, с которыми при запуске рассылок сталкиваются как начинающие маркетологи, так и профи. Присоединяйтесь!",
    "create_datetime": "",
    "is_active": "False",
    "user_id": "1"
  },
  {
    "category": "Мобильная разработка",
    "name": "GIT-ветвление и попытка не запутаться",
    "slug": "git-vetvlenie-i-popytka-ne-zaputatsya",
    "description": "Наша компания занимается разработкой ПО для госсектора и постоянно сертифицирует свои программы для обработки гос. тайны. А это накладывает определенные ограничения и самое главное из них: мы должны предоставить все исходные коды нашего проекта и если попросят - суметь объяснить, что делает каждая строчка. Проблема в том, что если используешь готовые компоненты, то их исходники тоже нужно предоставлять и уметь все про них рассказать. Поэтому мы решили сделать свой фреймворк, ведь про него мы будем знать все. Фреймворк мы сделали и назвали его \"Platform\". Он продолжает развиваться и все свои проекты мы делаем на нем. Проблема заключается в том что, после выпуска продукта и его сдачи мы вынуждены его замораживать и не можем в него вносить больших изменений - только исправлять баги, а большинство багов обнаруживается как раз в самом фреймворке и в результате мы вынуждены иметь версии фреймворка для каждого сданного проекта (ну, или для группы одновременно выпущенных продуктов). В итоге, нам пришлось придумать свой набор правил и схему ветвления в GIT для разработки Platform. Схема приведена ниже вместе с примером работы по ней:",
    "posts_text": "Наша компания занимается разработкой ПО для госсектора и постоянно сертифицирует свои программы для обработки гос. тайны. А это накладывает определенные ограничения и самое главное из них: мы должны предоставить все исходные коды нашего проекта и если попросят - суметь объяснить, что делает каждая строчка. Проблема в том, что если используешь готовые компоненты, то их исходники тоже нужно предоставлять и уметь все про них рассказать. Поэтому мы решили сделать свой фреймворк, ведь про него мы будем знать все. Фреймворк мы сделали и назвали его \"Platform\". Он продолжает развиваться и все свои проекты мы делаем на нем. Проблема заключается в том что, после выпуска продукта и его сдачи мы вынуждены его замораживать и не можем в него вносить больших изменений - только исправлять баги, а большинство багов обнаруживается как раз в самом фреймворке и в результате мы вынуждены иметь версии фреймворка для каждого сданного проекта (ну, или для группы одновременно выпущенных продуктов). В итоге, нам пришлось придумать свой набор правил и схему ветвления в GIT для разработки Platform. Схема приведена ниже вместе с примером работы по ней:",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  },
  {
    "category": "Дизайн",
    "name": "14 свежих и полезных дизайн-ресурсов в Январе",
    "slug": "14-svezhih-i-poleznyh-dizajn-resursov-v-yanvare",
    "description": "Что в сегодняшнем выпуске: различные генераторы, крутые источники для вдохновения, стильные иконки, топовые продукты из Product Hunt за 2020 год, инструменты для экспорта анимаций и гифок, и многое другое.",
    "posts_text": "Что в сегодняшнем выпуске: различные генераторы, крутые источники для вдохновения, стильные иконки, топовые продукты из Product Hunt за 2020 год, инструменты для экспорта анимаций и гифок, и многое другое.\n\n\nВнимание, тёмный паттерн — cамые горячие ресурсы мы оставили в конце - так что скролльте с предвкушением.\n\nПогнали!\n\n14. Vektors\n\nVektors – это агрегатор коллекций с иллюстрациями. Все иллюстрации этого ресурса бесплатные (но на некоторые коллекции есть пользовательские лицензии).\n\nВ Vektors вы найдете иллюстрации от художников по всему миру и для самых разных проектов. Иллюстрации доступны в форматах PNG, SVG, Figma, Sketch.\n\nНа данный момент паки насчитывают 70+ единиц.\n\n13. Pattern Generator\n\nБраузерный генератор текстур позволяет создавать уникальные royalty-free текстуры.\n\nУ Pattern Generator гибкие настройки: выбрав базовый стиль, вы можете затем настроить свою текстуру с помощью цветов, фильтров и преобразований. Каждый стиль узора имеет свои уникальные преобразования. Кнопка «Shuffle» — это та же кнопка «Random», которая перемешивает стили и выдает рандомизированные элементы.\n\nЭкспортнуть файл можно не только в JPEG или PNG, но и в качестве кода для inline SVG и фоновой картинки CSS.\n\n12. Gumaffiliates\n\nGumaffiliates – новый ресурс, который позволяет развивать партнерский маркетинг через Gumroad.\n\nИдеален как для креативщиков без аудитории, так и для affiliate-маркетологов с аудиторией, но без своей продукции.\n\nПриобретя товар (Gumaffiliates стоит $1):\n\n1) Креативщики получают таблицу людей с аудиторией;\n\n2) Affiliate-маркетологи получают таблицы с продуктами, которые нужно продвигать.\n\nВ таблицы входят следующие данные: название продукта (в случае affiliate партнера – это название аудитории), ниша, сайт, контактные данные.\n\n11. Parametric Color Mixer\n\nParametric Color Mixer позволяет генерировать цвета и затем настраивать палитру при помощи интерактивных эквалайзеров.\n\nПосле того, как вы определились с выбором цвета, его можно регулировать посредством следующих параметров: Положение, Воздействие, Диапазон, Смешивание.\n\nКоличество цветовых гамм можно как добавлять, так и уменьшать.\n\nЭкспорт – в SVG и CSS.\n\n10. Game UI Database\n\nЭтот сайт создан специально для дизайнеров, специализирующихся на создании игр.На этом ресурсе вы найдете обширную базу самых разных элементов: от различных попап-меню до HUD элементов. Просто кладезь информации для игровых дизайнеров.Почти 13 000 скриншотов из 355 игр. Более 80 типов экранов.\n\nУ сайта очень удобная система поиска. Боковая панель отображает фильтры для типов экранов: меню заголовков, состояния, статистика, информация, сетевые функции, игровой процесс и HUD.\n\nТакже можно фильтровать по жанру, теме, эстетическим элементам игр, устройству / элементам управления и т.д.\n\n9. GIFRun\n\nGIFRun позволяет создавать GIF-изображения без водяных знаков с разных соцсетей, типа YouTube, Facebook, TikTok, Vimeo, Twitter и многих других, где есть функция встроенного видео.\n\nПросто вставьте ссылку источника, определите продолжительность и время начала, добавьте текст (по желанию) и ваш GIF-файл готов.\n\n8. Doodle Strudel\n\nЕсли вы работаете художником или иллюстратором – то попробуйте Doodle Strudel. Этот генератор задач от Пабло Стэнли – отличная вещь для тех, у кого кризис идей.\n\nТолько здесь вы найдете такие безумные задачи, как например: “Нарисовать остроумную лошадку с большими наушниками, которая читает книгу на улице”. ?\n\n7. Scale\n\nScale – отличный сайт с красивыми иллюстрациями, которые подойдут как для дизайна приложений или сайтов, так и для различных промо-материалов или презентаций.\n\nНужную иллюстрацию можно найти в поисковой строке, или профильтровать по полу, а при настройке – можно подбирать цветовую схему в поле HEX-кода.\n\nИллюстрации доступны в SVG и PNG форматах.\n\nРесурс совсем новый, но коллекция эффектных иллюстраций насчитывает уже более 120 единиц.\n\nАвторы гарантируют каждый день выкладывать что-то новое.\n\n6. UX Database\n\nКаталог UX-ресурсов, который мы заслуживаем.\n\nВ этой новой мощной базе данных вы найдете тщательно отобранные продукты на все случаи жизни: лучшие инструменты, плагины, методологии, учебные ресурсы и многое другое.\n\nСортировать можно по следующим категориям: исследования, анализ, визуальный дизайн, дизайн интерфейсов, продукты нового поколения (AR / VR, чат-боты и т. д.), продуктивности, обучению, мультимедиа.\n\nБаза данных также удобна тем, что каждый ресурс помечен доступностью: платный, бесплатный или с лицензией Freemium.\n\n5. Pattern Collect\n\nPattern Collect – это своеобразный Dribbble для художников, создающих узоры и текстуры.\n\nС этой галереей, вы можете не только ловить вдохновение и улучшать свои навыки, но и загружать туда свои работы, параллельно освежая свое портфолио.\n\nРесурс содержит шаблоны в 45 категориях, включая: абстракцию, лица, геометрические фигуры, краски, ретро и многое другое.\n\n4. Flow\n\nFlow – это новый игрок на рынке моушн-дизайна. В арсенал инструмента входит:\n\n· Импорт файлов Figma, Sketch, XD, Illustrator, Affinity и т.д. (в будущем обещают добавить поддержку Instagram и Dribbble);\n\n· Большой ассортимент самых разных функций для крутого анимирования;\n\n· Прямой экспорт ваших анимаций из Sketch / Figma в чистый код для Swift, React, SVG и др.\n\nАнимации onboarding экранов, кнопок, рекламного контента и промо-роликов – Flow станет отличным помощником в добавлении изюминки вашему продукту.\n\nК тому же, интерфейс Flow интуитивно понятен, т.к. вобрал в себя лучшие практики интерфейса дизайн-инструментов последних лет. Поэтому, если вы умеете работать в Figma или Sketch – значит вы быстро разберетесь и с Flow.\n\n3. Byte Dance Icons\n\nByte Dance Icons — крутая коллекция иконок из Figma community, содержащая\n\nпочти 3000 элементов для самых разных проектов. Иконки доступны в стилях outlined, filled и two-tone.\n\nДля использования иконок в коде доступна документация для Vue и React.\n\nКоллекция постоянно обновляется.\n\n2. Best of Product Hunt\n\nОдин энтузиаст собрал в Notion таблицу с лучшими продуктами на Product Hunt за 2020 год. Здесь вы найдете коллекцию из более чем 360 продуктов.\n\nВ настройках просмотра можно выбрать наиболее удобный для себя тип просмотра контента: вид галереи, вид доски или вид таблицы. Таблица содержит всю необходимую информацию по каждому продукту: название проекта, дата запуска на ProductHunt, количество голосов, ссылка на картинку.\n\nНа 1-ом месте у нас статья The State of Design Systems: 2020. Это очень информативный материал, где Google провел исследование касательно использования дизайн-систем в 2020 году. В этом исследовании Google опросил более 1000 дизайнеров.\n\n1. The State of Design Systems 2020\n\nДелимся с вами основными результатами.\n\nUI киты, по мнению 83% опрошенных – одна из главных составляющих дизайн-системы. Что в очередной раз подтверждает эффективность его использования.\n\nFigma – лидер в таких компонентах, как:\n\n1) Инструменты для дизайна цифровых продуктов;\n\n2) Инструменты дизайн-документации и передачи файлов разработчикам;\n\n3) Инструменты, используемые для управления дизайн-системами.\n\nMaterial Design – с отрывом на первом месте в сегменте используемых дизайн-систем. Далее идут Apple’s Human-Interface Guidelines и Bootstrap (неожиданно!).\n\nВсе больше компаний предпочитают создавать собственные дизайн-системы. 80% респондентов сообщили, что они разрабатывали собственные дизайн-системы внутри компаний. Основная причина – своя дизайн-система лучше соответствует бренду компании.\n\nНа этом всё. Забирайте себе в коллекцию, если нашли что-нибудь полезное для себя. Как только наберем новых ресурсов, ждите новый пост.",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  },
  {
    "category": "Дизайн",
    "name": "Давайте разбираться: небо темнеет",
    "slug": "davajte-razbiratsya-nebo-temneet",
    "description": "Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий требует анализа направлений прогрессивного развития. Господа, современная методология разработки не оставляет шанса для первоочередных требований.",
    "posts_text": "Принимая во внимание показатели успешности, социально-экономическое развитие предоставляет широкие возможности для стандартных подходов. Предварительные выводы неутешительны: постоянный количественный рост и сфера нашей активности, в своём классическом представлении, допускает внедрение экспериментов, поражающих по своей масштабности и грандиозности. Ясность нашей позиции очевидна: современная методология разработки в значительной степени обусловливает важность позиций, занимаемых участниками в отношении поставленных задач. В частности, сплочённость команды профессионалов обеспечивает широкому кругу (специалистов) участие в формировании дальнейших направлений развития.",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  },
  {
    "category": "Веб-разработка",
    "name": "Современная методология разработки процветает, как ни в чем не бывало",
    "slug": "sovremennaya-metodologiya-razrabotki-procvetaet-kak-ni-v-chem-ne-byval",
    "description": "Современные технологии достигли такого уровня, что высокое качество позиционных исследований обеспечивает широкому кругу (специалистов) участие в формировании распределения внутренних резервов и ресурсов. Каждый из нас понимает очевидную вещь: базовый вектор развития является качественно новой ступенью поставленных обществом задач. В рамках спецификации современных стандартов, сделанные на базе интернет-аналитики выводы, превозмогая сложившуюся непростую экономическую ситуацию, функционально разнесены на независимые элементы.",
    "posts_text": "Как уже неоднократно упомянуто, акционеры крупнейших компаний, вне зависимости от их уровня, должны быть описаны максимально подробно. Учитывая ключевые сценарии поведения, высокое качество позиционных исследований играет важную роль в формировании своевременного выполнения сверхзадачи. Следует отметить, что экономическая повестка сегодняшнего дня, в своём классическом представлении, допускает внедрение как самодостаточных, так и внешне зависимых концептуальных решений. В частности, синтетическое тестирование, а также свежий взгляд на привычные вещи - безусловно открывает новые горизонты для модели развития.",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  },
  {
    "category": "Маркетинг",
    "name": "Эксперты утверждают, что реализация намеченных плановых заданий даёт нам право принимать самостоятельные решения!",
    "slug": "eksperty-utverzhdayut-chto-realizaciya-namechennyh-planovyh-zadanij-da",
    "description": "Имеется спорная точка зрения, гласящая примерно следующее: интерактивные прототипы призывают нас к новым свершениям, которые, в свою очередь, должны быть своевременно верифицированы. Банальные, но неопровержимые выводы, а также действия представителей оппозиции, превозмогая сложившуюся непростую экономическую ситуацию, в равной степени предоставлены сами себе.",
    "posts_text": "Идейные соображения высшего порядка, а также высокое качество позиционных исследований предоставляет широкие возможности для первоочередных требований. Лишь реплицированные с зарубежных источников, современные исследования, инициированные исключительно синтетически, обнародованы. Прежде всего, внедрение современных методик создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса стандартных подходов.",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  },
  {
    "category": "Дизайн",
    "name": "Эксперты утверждают, что реализация намеченных плановых заданий даёт нам право принимать самостоятельные решения!",
    "slug": "eksperty-utverzhdayut-chto-realizaciya-namechennyh-planovyh-zadanij-da",
    "description": "Имеется спорная точка зрения, гласящая примерно следующее: интерактивные прототипы призывают нас к новым свершениям, которые, в свою очередь, должны быть своевременно верифицированы. Банальные, но неопровержимые выводы, а также действия представителей оппозиции, превозмогая сложившуюся непростую экономическую ситуацию, в равной степени предоставлены сами себе.",
    "posts_text": "Идейные соображения высшего порядка, а также высокое качество позиционных исследований предоставляет широкие возможности для первоочередных требований. Лишь реплицированные с зарубежных источников, современные исследования, инициированные исключительно синтетически, обнародованы. Прежде всего, внедрение современных методик создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса стандартных подходов.",
    "create_datetime": "",
    "is_active": "True",
    "user_id": "1"
  }
]